test: add deterministic test for distributed system for anti-entryopu
